Revit 2024 API
BuiltInFailures.DesignOptionFailures.MustAddKingWarn Property
 In order to add this '[Serf]' to the Option Set, you must also add its '[King]'--if you continue it will not be added to the Option Set
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MustAddKingWarn { get; }
Visual Basic
Public Shared ReadOnly Property MustAddKingWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MustAddKingWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace